🚀&nbsp; env0 had composed a PR Plan for environment [dev / mysql ](https://app.env0.com/p/0bb549e6-644c-4d70-bd5f-d59679fab8a1/environments/b4d269ce-0573-4ecd-9b2a-e3fe5248b5d1):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform will perform the following actions:


  # aws_db_instance.mysql will be created
+   resource "aws_db_instance" "mysql" {
+       address                               = (known after apply)
+       allocated_storage                     = 20
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       db_name                               = "fffaa"
+       db_subnet_group_name                  = (known after apply)
+       delete_automated_backups              = true
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_version                        = "8.0.36"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = (known after apply)
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t2.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = (known after apply)
+       password                              = (sensitive value)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = false
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = "standard"
+       tags_all                              = (known after apply)
+       timezone                              = (known after apply)
+       username                              = (sensitive value)
+       vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   arn      = (known after apply)
+   db_name  = "fffaa"
+   endpoint = (known after apply)
```
</details>


```
Monthly cost change for env0/terragrunt-infrastructure-live-samle/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($0.00 → $14)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
──────────────────────────────────
Project: env0/terragrunt-infrastructure-live-samle/.env0workdir/env0_tf_plan.json

+ aws_db_instance.mysql
  +$14

+     Database instance (on-demand, Single-AZ, db.t2.micro)
      +$12

+     Storage (magnetic)
      +$2

+     I/O requests
      Monthly cost depends on usage
        +$0.10 per 1M requests

Monthly cost change for env0/terragrunt-infrastructure-live-samle/.env0workdir/env0_tf_plan.json
Amount:  +$14 ($0.00 → $14)

──────────────────────────────────
Key: ~ changed, + added, - removed

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

Infracost estimate: Monthly cost will increase by $14 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━┓
┃ Project                                                          ┃ Cost change ┃ New monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━━━━┫
┃ env0/terragrunt-infrastructure-....env0workdir/env0_tf_plan.json ┃        +$14 ┃ $14              ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━━━━┛
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/0bb549e6-644c-4d70-bd5f-d59679fab8a1/environments/b4d269ce-0573-4ecd-9b2a-e3fe5248b5d1/deployments/ac1cec0d-cb3c-424d-b522-9f5f7b84e2ed)